interface Book {
  imgSrc: string;
  name?: string;
  subject?: string;
  author?: string;
  authorInfo?: string;
  summary?: string[];
  MyOpinion?: string;
  importantKeyword?: string;
  address: string;
}

export const harvard: Book = {
  imgSrc: "http://image.yes24.com/goods/57634898/XL",
  address: "harvard",
  name: "하버드의 새벽 4시 반",
  subject: "자기계발서",
  author: "웨이슈잉(韦秀英)",
  authorInfo:
    "도서편집 경력 10년차인 유명한 출판기획자이다. 『하버드 새벽 4시 반』, 『카네기가 여성에게 선사하는 일생의 행복에 대한 충고』, 『여자 팔자 이렇게 하면 핀다』, 『기질은 어디에서 오는가』, 『마음이 평온해야 경솔하게 행동하지 않는다』 등의 베스트셀러를 만들어냈다. 현재는 하버드 전문 기고가로 활동 중이며, 특히 젊은 학생과 직장인들에게서 선풍적인 인기를 얻고 있다. 중국 CCTV 방송국 다큐멘터리 [세계유명대학] 하버드 편의 내용을 바탕으로 하여 이 책을 펴냈다.",
  summary: [
    "최고 베스트셀러 『하버드 새벽 4시 반』 100쇄 기념 리커버 에디션",
    "“당신의 새벽이 하버드보다 밝아야 하는 이유!” ",
    "1636년, 미 동부 매사추세츠 주에 ‘글을 읽을 줄 아는 성직자를 양성하기 위한’ 소박한 목적으로 하버드가 설립되었다. 하버드는 이후 미 동부 8개 명문을 일컫는 아이비리그 중 하나가 되었으며, 현재는 자타가 공인하는 세계 최고의 대학으로 꼽힌다. 현재까지 하버드 졸업생 가운데에서 8명의 미국 대통령, 75명의 노벨상 수상자가 배출되었으며, 작가나 연구진 등의 성과까지 살펴보면 하버드가 세계 최고로 불리는 것에 저절로 고개가 끄덕여진다. 하버드에서는 도대체 어떤 사람들이 무엇을 배우기에 이곳을 졸업한 후에도 그토록 두각을 나타내는 걸까?",
    "『하버드 새벽 4시 반』은 이러한 하버드의 특별함이 어디에서 나오는지를 분석하면서, 불투명한 미래를 걱정하며 방황하는 우리 청년들에게 하버드 식 성공법을 전수한다. 이 책의 저자는 하버드와 그 학생들의 특별함을 10가지로 정리했다. 하버드에서 강조하는 교육 철학 중 가장 대표적인 것으로 ‘노력, 자신감, 열정, 행동력, 배움, 유연성, 시간관리, 자기반성, 꿈, 기회’라는 키워드를 꼽았다. 그런데 이들은 흔히 우리가 ‘하버드’에서 떠올리는 것들과는 다소 차이가 있다는 점이 눈에 띈다. 즉 ‘천재성’, ‘지식’, ‘스펙’ 등이 아닌 ‘노력’과 ‘꾸준함’이 강조된다는 것이다.",
    "이 책에는 세계적인 천재들이 모인 하버드에서 14등이라는 훌륭한 성적으로 졸업한 사람이 온 힘을 다해 자신의 한계를 넘어서지 못함을 반성하는 사례가 실려 있다. 또한 한 회사에서 수습 기간 동안에 아무도 거들떠보지 않는 잡무를 남몰래 처리하고 퇴근했던 하버드 출신의 지원자를 합격시킨 이야기도 소개된다. 이런 이야기들은 하나같이 하버드에서 교육받은 이들의 대단한 스펙 대신에 그들의 일과 배움에 대한 애티튜드를 강조한다. 하버드 졸업생들의 이야기뿐 아니라, 하버드 강의 중에 소개된 여러 교훈적인 이야기들과 격언들은 독자들에게 강렬한 메시지를 제공하고 있다.",
  ],
  MyOpinion: "qwe",
  importantKeyword: "중요 키워드",
};
export const myself: Book = {
  imgSrc: "http://image.yes24.com/goods/22659314/XL",
  address: "myself",
  name: "내 안에서 나를 만드는 것들",
  subject: "자기계발서",
  author: "러셀 로버츠 (Russell Roberts)",
  authorInfo:
    "노스캐롤라이나 대학에서 경제학 학사학위를 받았고, 시카고 대학에서 박사학위를 받았다. 조지메이슨 대학 경제학과 교수를 지냈으며 세인트루이스의 워싱턴 대학, UCLA, 스탠포드 대학, 로체스터 대학 등에서도 강의했다. 경제·정부·공공정책에 관한 연구를 진행하는 와이덴바움 센터의 수석연구원, 워싱턴 대학 경험학습 센터의 초대 소장을 지냈다. 『알약으로 텔레비전을 만드는 경제학』의 원 저작인 『The Choice : A Fable of free trade and protectionism』은 『비즈니스 위크』와 『파이낸셜 타임즈』에서 ‘최고의 비즈니스에 관한 책’으로 선정되기도 했다. 저서로는 『초이스』『내 안에서 나를 만드는 것들』『보이지 않는 마음』 등이 있다",
  summary: [
    "“어렵지 않습니다.  가장 중요한 것은, 나를 일으켜 세우는 것입니다.”",
    "“250년 전 쓰여진 가장 완벽한 인생 조언수많은 사람들의 인생을 뒤바꾼 책일과 관계, 부와 행복에 관한 숨겨진 보물 같은 책 ",
    "나를 만드는 것은 무엇일까? 나 자신일까, 또 다른 무엇일까?",
    "그 누구도 아닌 나 자신에 대한 질문인데 쉽게 답이 나오지 않는다. 혹시 내가 아닌 다른 외부적 요소들이 나를 만들고 있는 것은 아닐까? 직업, 사는 곳, 자동차, 통장 잔고 등 지금 나는 내 바깥에서 만들어지고 있는지도 모를 일이다.",
    "왜 이 질문이 중요한가?",
    "살아가면서 우리가 원하는 확실한 한 가지 때문이다.",
    "‘잘되는 나’, 더 나은 삶을 이루고 싶은 마음이 그것이다. 그렇다면 진짜 ‘잘되는 나’는 어떻게 만들어질까? 『국부론』의 저자, ‘자본주의 아버지’라 불리는 애덤 스미스는 어떤 거창한 주장을 펼쳤을까?",
    "애덤 스미스는 이런 인간의 본 모습을 일찍이 알아차렸던 것 같다. 그는 더 나은 삶, 잘되는 나를 만들기 위해 반드시 자기 자신을 알아야 한다고 역설했다. 그리고 이에 대한 주옥같은 해답지를 『도덕감정론』이라는 책에 정성스레 담아냈다. 사람과 인생에 대한 그의 통찰력이 빛나는 불후의 역작이다.",
    "이 숨겨진 대작을 스탠포드 교수이자 베스트셀러 저자인 러셀 로버츠가 다시 끄집어내어 쉽게 풀어쓴 책이 출간됐다. 250년 전 쓰여진 고전을 전 세계 현대인의 삶에 맞추어 새롭게 설명한 책, 『내 안에서 나를 만드는 것들』이다. 『도덕감정론』이라는 원저의 중심 내용을 친절한 해설, 재미있는 사례와 함께 읽을 수 있는 교양 도서다.",
    "무엇보다 『내 안에서 나를 만드는 것들』은 옛 고전이 주는 무게감을 덜어내도록, 쉽고 편하게 쓰였다. 그렇지만 원저가 주는 깊이와 감동은 동일하게 느낄 수 있도록 그 핵심과 정수를 고스란히 담았다. 이 책이야말로 지금 우리에게 가장 필요한 ‘인생 예습’이자 ‘인생 수업’이라 할 수 있다.",
  ],
  MyOpinion: "qwe",
  importantKeyword: "중요 키워드",
};
export const philosophy: Book = {
  imgSrc: "http://image.yes24.com/Goods/11922751/L",
  address: "philosophy",
  name: "프로그래머 철학을 만나다",
  subject: "철학",
  author: "유석문",
  authorInfo:
    '한때는 개발자의 끝이 통닭집이 아님을 증명하겠다며 의기양양하게 살았고 지금은 "그 돈이나 모을 수 있으려나?" 걱정하며 살고 있다. 하지만 대기업, 벤처, SI, 포털 서비스를 거치며 "소프트웨어 개발은 정말 재밌다"는 사실에 늘 감동하고 있다. 회사에 근무하는 일 외에 소프트웨어마에스트로 멘토로 활동 중이며 그간의 실패담을 공유하여 다른 분의 성공 가능성을 높이는 일에 흥미를 느끼고 있다. 오픈소스 NTAF 개발에 참여 중이며 저서로 『소프트웨어 품질 관리: NHN은 이렇게 한다!』(공저, 위키북스, 2010), 『프로그래머로 산다는 것』(공저, 로드북, 2012)이 있다.',
  summary: [
    "기술적으로 뛰어난 인재를 갖추고도 소프트웨어 개발은 실패할 수 있습니다. 바로 ‘사람’이 관여하고 있기 때문입니다. 사람이 함께 함으로써 발생되는 문제들, 이것은 결코 기술적인 지식만으로 해결할 수 없습니다. 이 책은 철학이라는 프레임을 통해 소프트웨어 개발 현장을 들여다보고 그 속에서 발생되는 문제들이 사람이기 때문에 일어날 수 있다는 사실을 알려주고 있습니다. 그리고 그 문제에 대해 실천적인 지혜를 제시합니다. 개발자뿐만이 아니라 소프트웨어 개발에 참여하는 모든 사람들이 쉽게 읽어볼 수 있는 책입니다. 이 책을 통해 팍팍한 우리의 삶이 조금이나마 편해지고 행복해지면 좋겠습니다. (이 책의 저작권료는 전액 초록우산 어린이재단에 기부됩니다)",
    "대상 독자",
    "소프트웨어 개발 현장에서 발생하는 기술적 문제 외에 실패, 좌절, 불안, 불협화음, 무력감 등의 문제를 겪고 있는 모든 소프트웨어 개발 종사자",
    "실천적 지혜는 결국 ‘사람’을 이해하는 것이다",
    "소프트웨어 개발에서 언제나 우리를 괴롭히는 것은 기술이 아니라 일정한 입력에 일정한 응답을 제공하지 않는 ‘사람’이다. 때로는 협업의 적이 되기도 하고 화를 불러 조직을 무너뜨리기도 하며 서로의 공격으로 자존감을 손상시켜 무력감을 주기도 한다. 우리가 사람이기 때문에 일어나는 일들이다. 이 책은 바로 이러한 문제들을 어떻게 풀 것인가에 대한 실천적 해답을 찾고자 하였다. 그리고 이 책에서 사용한 프레임은 ‘철학’이다. 철학을 통해 소프트웨어 개발 환경을 들여다보고 실천적 지혜를 찾아본다.",
    "“그 동안 잘못되었다고, 이해할 수 없다고 생각했던 모든 일이 사람이기 때문에 일어나는 것이고 필자 또한 그 안에 속해 있음을 처음으로 인정할 수 있었다. 나는 맞고, 남들은 틀렸다”는 전제를 가지고 세상을 보고 있었고, 그로 인해 협업이 아닌 계몽이란 허황된 꿈을 꾸고 있었음을 알게 된 것이다. 불행 중 다행히도 잘못을 인정하고 받아들여야 한다는 점과 실수를 했다고 가치 없는 사람이 아니라는 사실을 방금 읽은 스토아 철학을 통해 배운 덕에 자책하느라 시간 낭비를 하지는 않았다. 이 책은 이러한 필자의 경험이 담겨있다.”",
  ],
  MyOpinion: "qwe",
  importantKeyword: "중요 키워드",
};
export const live: Book = {
  imgSrc: "http://image.yes24.com/momo/TopCate207/MidCate001/20609994.jpg",
  address: "live",
  name: "프로그래머로 산다는 것",
  subject: "IT 에세이",
  author: "이상민",
  authorInfo:
    "삼성SDS에서 개발을 시작하여 NAVER, NHN 등의 회사에서 일했다. 『자바의 신』, 『자바 성능 튜닝 이야기』 등 다수의 IT 서적을 집필하였다. 지금은 국내 최고의 스마트 통합 주차 회사인 파킹 클라우드에서 개발 총괄 이사로 일하고 있다.",
  summary: [
    "프로그래머라는 이름으로 살고 있고 살아갈 사람들에게",
    "“난 프로그래머, 왠지 앞이 캄캄해!”",
    "“IT는 왜이리 빨리 변하는 거야, 힘들다!”",
    "“다른 사람은 어떻게 살아가고 있지?”",
    "“조직 생활이 힘들어, 박차고 나가야 하나?”",
    "“내가 왜 이 길을 택했지?”",
    "프로그래머라는 이름으로 살고 있고 살아갈 사람들에게, 다시 한 번 프로그래머의 길을 생각합니다. 적어도 뼛속까지 프로그래머이고 싶고 그렇게 살아가고 있는 사람들의 이야기, 다시 한번 여러분의 가슴을 뛰게 했으면 합니다.",
    "이 책은 독자에게 “여러분 탓이 아닙니다”라는 공감을 표시한다. 공자는 40세 “미혹하지 않았다(四十而不惑)”라는 의미로 불혹(不惑)을 이야기 했지만 불혹을 넘어선 또는 언저리에 도달한 저자들은 미혹되며 살아가는 모습과 프로그래머의 삶 굽이굽이 돌아가며 마주쳤던 고민과 선택의 경험담을 제공한다. 그렇다고 단순히 푸념을 얼버무려 놓았거나 허황된 희망과 찬사로 치장하지도 않았다. 그렇기에 글을 읽으면 “나만의 고민이 아니구나”라는 동질감과 색다른(?) 희망을 얻을 수 있다.",
    "'공감'하는 사람을 만나는 것이 '행복'의 첫 걸음이다. 이 책의 저자들은 소프트웨어 개발이라는 공감 요소를 가지고 있으며 더 좋은 방향과 지속적인 발전에 관심을 가지고 있다. 이 책이 직접적인 문제 해결에 도움이 되지 않을 수 있지만 '행복한 프로그래머'라는 명제를 이야기 하고 공감하는 데 기여하길 바라는 마음이다.",
    "- 저자 대표 유석문",
    "로드북의 [사람과 프로그래머] 시리즈 세 번째 이야기다. 이 시리즈는 기술이 만들어내는 세상이 아닌 사람이 만들어내는 세상을 바라는 마음에서 기획되었다. 즉, 기술보다는 ‘사람’에 포커스를 두고 있다.",
    "기술 서적과 달리 에세이는 저자의 주관적 생각이 많아 상황에 따라 다양하게 해석될 수 있고 적용될 수 있다. 따라서 비판적 읽기가 중요함을 먼저 이야기하고 싶다. 다양성을 인정하고 열린 마음으로 읽어주길 바란다. 여러분의 인생에 도움을 줄 한 줄의 포인트라도 낚는다면 편집자로서 더할 나위 없는 행복일 것이다.",
  ],
  MyOpinion: "qwe",
  importantKeyword: "중요 키워드",
};
export const talkGod: Book = {
  imgSrc: "http://image.yes24.com/momo/TopCate0001/kepub/L_276813.jpg",
  address: "talkGod",
  name: "대화의 신",
  subject: "자기계발서",
  author: "래리 킹 (Larry King)",
  authorInfo:
    "‘토크쇼의 제왕’, ‘대화의 신’이라 불리는 세계 최고의 앵커. 1957년 라디오 진행자로 방송을 시작한 이후, 50여 년간 5만 명 이상의 사람들과 인터뷰를 해온 방송계의 ‘살아 있는 전설’이다.래리 킹은 1985년부터 CNN의 <래리 킹 라이브>를 진행하면서 스타 인터뷰어의 반열에 올랐다. 2010년 종영 때까지 25년간 방송된 <래리 킹 라이브>는 전 세계에서 가장 영향력 있는 프로그램으로 인정받아왔다. 그의 쇼에는 오바마 대통령을 비롯한 수많은 미국 대통령들과 빌 게이츠, 넬슨 만델라, 마이클 조던, 레이디 가가 같은 할리우드 스타, 세계적인 지도자, 스포츠 선수 등 셀 수 없이 많은 유명 인사들이 출연했다. 래리 킹은 게스트의 솔직한 이야기를 이끌어내는 탁월한 능력과 특유의 날카롭고 위트 있는 인터뷰로 ‘TV 역사상 가장 독보적인 토크쇼 진행자’라는 찬사를 받았다. 이 책은 별 볼 일 없던 그가 ‘대화의 신’의 경지에 오를 수 있었던 비결을 생생히 보여준다. 말 잘하고 싶은 사람이라면, 반세기 동안 수많은 사람들과 성공적인 대화를 이어나갔던 그만의 노하우를 전수 받을 수 있을 것이다. 또한 ‘누구와도’, ‘어떤 상황에서도’ 자연스럽게 말할 수 있는 상황별 대화법을 쉽고 구체적으로 배울 수 있다. 2013년 여든 살이 넘는 나이로 미국 라디오 프로그램에 복귀했고, 러시아 보도전문채널 RT TV의 <래리 킹 나우>를 진행하며 현재도 왕성한 활동을 이어가고 있다. 저서로는 《래리 킹, 원더풀 라이프》, 《리더들은 어떻게 기도할까》 등이 있다",
  summary: [
    "“제발 말 좀 잘하고 싶다!”대화가 두려운 당신을 위한 상황별 솔루션 공개!",
    "가족 간이나 친구 간에 혹은 비즈니스 관계에서, 모든 커뮤니케이션을 시작하고 성공적으로 이끌어가는 핵심 요소는 ‘말’이다. 그런데 대부분의 사람들은 어떤 말로 시작해야 할지, 또 어떻게 대화를 지속하고 끝내야 하는지 잘 알지 못하고, 그런 까닭에 대화에 대한 두려움을 가지고 있다. 저자는 그동안 축적해온 수많은 인터뷰와 대화 경험을 통해, 왜 사람들이 말하기를 겁내는지 그 이유를 조목조목 짚어낸다. 또한 말주변 없는 사람이라도 자연스럽게 말할 수 있는 자신만의 대화 노하우를 전수한다. 그는 ‘진심 어린 경청’과 ‘솔직함’은 소통을 위한 최고의 무기라고 강조하며, 성공적인 대화를 위한 기본 자세부터 바꿀 것을 제안한다.",
    "책에는 특히 낯선 사람에게 말을 걸 때, 프레젠테이션을 할 때, 각종 모임에서 이야기해야 할 때 등 상황별로 적용할 수 있는 대화의 기술이 구체적으로 담겨 있다. ‘질문만 잘해도 대화는 끊기지 않는다’, ‘내가 가장 잘 아는 것을 말하라’, ‘사람들 많은 곳에서는 1:1로 공략한다’ 등 저자가 알려주는 명확하고 단순한 솔루션은 대화에 바로 써먹을 수 있도록 했다. 또한 저자가 직접 겪은 재미있고 풍부한 사례를 통해 말 잘하는 사람들의 실질적인 노하우를 익히고, 말하기에 대한 막연한 공포에서 벗어날 수 있게끔 했다.",
    "말 잘하는 사람들은 왜 이 책을 추천하는가? ",
    "상대의 마음을 단숨에 사로잡는 최고의 말하기 노하우!",
    "래리 킹은 제대로 된 대화 태도를 갖추고, 열린 자세로 상대를 대한다면 누구와도 성공적으로 말할 수 있다고 자신한다. 그것은 단순한 말하기 기술을 넘어 진정성 있는 소통법이며, 말 잘하는 사람들은 이 평범하지만 중요한 진리를 알기 때문에 항상 대화에 성공해왔다.",
    "이 책은 출신, 배경, 학벌 등에서 별 볼 일 없던 저자가 ‘역사상 가장 독보적인 토크쇼 진행자’로 인정받으며, 반세기 동안 방송계를 군림할 수 있었던 이유를 보여준다. 자신보다 상대방을 돋보이게 하는 자세, 속내를 털어놓게 만드는 깊은 공감, 핵심을 간파하는 적절한 질문은 저자가 누구든 어떤 상대도 단숨에 사로잡을 수 있었던 비결이었다. 그런 노하우를 담고 있는 까닭에, 수많은 방송인들과 언론인들이 ‘말하기의 교과서’라 부르며 이 책을 극찬해왔다.",
    "말하지 않고 사는 사람은 없지만, 말을 잘하는 사람은 드물다. 말을 잘한다는 것은 성공과 직접적으로 연관되어 있음을 직시해야 한다. 그것은 우리가 남들과 대화하는 방법을 제대로 배워야 하는 이유이기도 하다. 이 책에서 소개한 ‘누구와도’, ‘어떤 상황에서도’ 자연스럽게 말할 수 있는 대화법과 마인드를 익히고 활용하면, 말하기를 즐길 수 있고 성공에 한걸음 더 다가갈 수 있을 것이다.",
  ],
  MyOpinion: "qwe",
  importantKeyword: "중요 키워드",
};
